
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7688703478)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 4 to change, 1 to destroy.</code></pre>

* Create
  * local_file.index_page
* Update
  * aws_lambda_function.lambda
  * aws_lambda_function.scan
  * aws_s3_bucket.images
  * aws_s3_bucket.website
* Replace
  * null_resource.lambda_layer


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      ~ last_modified                  = "2024-01-28T22:00:41.597+0000" -> (known after apply)
      ~ source_code_hash               = "sdXkkIUn6SqwHkfapeP2yXoDz63SXDjjp7umyRdXzaU=" -> "CtGH/aYOplvmV382E5P1lpzNnd0jNdofmOnhZc4aqVg="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "mtchoun-mouh-lambda-layer-scan_user_consulcam"
      ~ last_modified                  = "2024-01-28T21:51:34.015+0000" -> (known after apply)
      ~ source_code_hash               = "sdXkkIUn6SqwHkfapeP2yXoDz63SXDjjp7umyRdXzaU=" -> "CtGH/aYOplvmV382E5P1lpzNnd0jNdofmOnhZc4aqVg="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer must be replaced
-/+ resource "null_resource" "lambda_layer" {
      ~ id       = "3717431181789917071" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-01-28T21:59:50Z" -> (known after apply)
        }
    }

Plan: 2 to add, 4 to change, 1 to destroy.

```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"e6e7e7a2ba34a1258ae0289c956ec226535e8213","Vars":{},"WorkflowName":"Deploy cases"} -->